export default class LoginUserProtocol {
    static U = '成都沃克邦科技有限公司（以下简称“沃克邦科技”）在此特别提醒您（用户）在注册成为用户之前，请认真阅读本《用户协议》（以下简称“协议”）以确保您充分理解本协议中各条款。本服务条款是您与乐业的所有者成都沃克邦科技有限公司及其关联公司之间就乐业提供的信息服务等相关事宜所订立的合约或合同。您的注册、登陆、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。\n' +
        '本协议约定乐业与用户之间关于“乐业”产品服务的权利义务。“用户”是指注册、登陆、使用本产品服务的个人或企业。本协议是用户与乐业之间的法律协议。\n' +
        '\n' +
        '\n' +
        '1.\t账号注册\n' +
        '1.1\t用户在使用本产品前需要注册一个“乐业”账号。“乐业”账号由用户实名认证的手机号码注册而成，以及第三方认证账号，如：微信、QQ、支付宝等账号进行注册登陆，请用户使用未被乐业根据本协议封禁的手机号码注册“乐业”账号，或使用未被封禁的第三方账号进行登陆。乐业可根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先通知用户；\n' +
        '1.2\t乐业将基于实时地理位置进行用工需求匹配，用户注册时应当授权乐业公开其使用其地理位置信息方可成功注册“乐业”账号。故用户完成注册即表明用户同意乐业提取、公开及使用用户的实时地理位置。如用户需要终止向其他用户公开其实时地理位置信息，可自行退出软件；\n' +
        '1.3\t鉴于“乐业”账号的绑定注册方式，您同意乐业在注册时将使用您提供的手机号码 及／或自动提取您的手机号码等信息用于注册；\n' +
        '1.4\t在用户注册及使用乐业时，乐业需要搜集能识别用户身份的个人信息以便乐业可以在必要时联系用户，或为用户提供更好的使用体验。乐业搜集的信息包括但不限于用户的性别、年龄、出生日期、个人说明、企业营业执照信息等；乐业同意对这些信息的使用将首先与用户个人隐私信息保护的约束。\n' +
        '\n' +
        '\n' +
        '2、服务内容\n' +
        '2.1 乐业是运用互联网技术所搭建的农民工与雇主的找工作和招聘工人的服务平台，提供智能数据分析，网上劳动力档案管理等服务，农民工端主要内容包括：找工作、上工打卡、薪资支付等；雇主端主要内容包括：招聘工人、上工管理、薪资支付等；\n' +
        '2.2 您需要对自己在帐户中的所有活动和事件负全责。如果由于您的过失导致您的手机号码或第三方账号脱离您的控制，则由此导致的针对您、或任何第三方造成的损害，您将承担全部责任；\n' +
        '2.3 用户理解并接受，乐业仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如个人电脑、手机、及其他与接入互联网或移动互联网有关的装置）及所需的费用（如为接入互联网而支付的电话费及上网费、为使用移动网而支付的手机费），均应由用户自行负担。\n' +
        '\n' +
        '\n' +
        '3、用户使用规则\n' +
        '3.1 用户在申请使用乐业提供的相关服务时，必须向乐业提供准确的个人资料，如个人资料有任何变动，需及时更新。因用户提供个人资料不准确、不真实而引发的一切后果由用户承担；\n' +
        '3.2 用户应妥善保存登陆所需的手机号码或第三方帐号，避免以任何脱离用户控制的形式交由他人使用。如用户发现其帐号遭他人非法使用，应立即通知乐业。因黑客行为或用户的保管疏忽导致帐号遭他人非法使用，乐业不承担任何责任；\n' +
        '3.3  用户应当为自身注册帐户下的一切行为负责，因用户行为而导致的用户自身或其他任何第三方的任何损失或损害，乐业不承担任何责任；\n' +
        '3.4  用户理解并接受乐业提供的服务中可能包括雇佣相关的建议、广告，用户同意在使用过程中显示乐业和第三方、合作伙伴提供的广告；\n' +
        '3.5 用户在使用乐业服务过程中，必须遵循以下原则：\n' +
        '3.5.1  遵守中国有关的法律和法规；\n' +
        '3.5.2  遵守所有与网络服务有关的网络协议、规定和程序；\n' +
        '3.5.3  不得为任何非法目的而使用网络服务系统；\n' +
        '3.5.4  不得利用乐业服务系统进行任何可能对互联网或移动网正常运转造成不利影响的行为；\n' +
        '3.5.5 不得利用乐业提供的网络服务上传、展示或传播任何虚假的、骚扰性的、\n' +
        '中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；\n' +
        '3.5.6 不得侵犯乐业和其他任何第三方的专利权、著作权、商标权、名誉权或其\n' +
        '他任何合法权益；\n' +
        '3.5.8 如发现任何非法使用用户帐号或帐号出现安全漏洞的情况，应立即通告乐业；\n' +
        '3.6 用户不得利用“乐业”账号或本产品进行如下行为：\n' +
        '3.6.1 提交、发布虚假信息，或盗用他人资料，冒充、利用他人名义\n' +
        '3.6.2 虚构事实、隐瞒真相以误导、欺骗他人的\n' +
        '3.6.3 利用技术手段批量建立虚假账号\n' +
        '3.6.4 利用“乐业”账号或本产品从事任何违法犯罪活动的\n' +
        '3.6.5 其他违法法律法规规定、侵犯其他用户合法权益，干扰乐业正常运营或沃克邦科技未明示授权的行为\n' +
        '3.6.6 进行任何不利于乐业及其所属公司的行为；\n' +
        '3.7 如用户在使用服务时违反任何上述规定，乐业或其所属公司有权要求用户改正或直接采取一切必要的措施（包括但不限于更改或删除用户收藏的内容等、暂停或终止用户使用服务的权利）以减轻用户不当行为造成的影响。\n' +
        '3.8 用户在本产品中或通过本产品所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表乐业的观点、立场或政策，乐业对此不承担任何责任。\n' +
        '\n' +
        '\n' +
        '4.  服务变更、中断或终止\n' +
        '4.1 鉴于网络服务的特殊性，用户同意乐业有权根据业务发展情况随时变更、中断或终止部分或全部的网络服务而无需通知用户，也无需对任何用户或任何第三方承担任何责任；\n' +
        '4.2  用户理解并确认，乐业需要定期或不定期地对提供网络服务的平台（如互联网网站、移动网络等）或相关的设备进行检修或者维护，如因此类情况而造成网络服务在合理时间内的中断，乐业无需为此承担任何责任，但乐业应尽可能事先进行通告；\n' +
        '4.3 如发生下列任何一种情形，乐业有权随时中断或终止向用户提供本协议项下的服务（包括收费服务）而无需对用户或任何第三方承担任何责任：\n' +
        '4.3.1 用户提供的个人资料不真实； \n' +
        '4.3.2 用户违反本协议中规定的使用规则。\n' +
        '\n' +
        '\n' +
        '5.  知识产权\n' +
        '乐业提供的网络服务中包含的任何文本、图片、图形、音频和/或视频资料均受版权、商标和/或其它财产所有权法律的保护，未经相关权利人同意，上述资料均不得用于任何商业目的。\n' +
        '\n' +
        '\n' +
        '6、用户个人隐私信息保护\n' +
        '6.1 用户在注册账号或使用本服务的过程中，可能需要填写或提交一些必要的信息，如法律法规、规章规范性文件（以下简称“法律法规”）规定的需要填写的身份信息。如用户提交的信息不完整或不符合法律法规的规定，则用户可能无法使用本产品或在使用本产品的过程中受到限制；\n' +
        '6.2 保护用户隐私是乐业的一项基本原则，乐业保证不对外公开或向第三方提供单个用户的注册资料及用户在使用服务时存储在乐业的非公开内容，但下列情况除外：\n' +
        '6.2.1 事先获得用户的明确授权；\n' +
        '6.2.2 根据有关的法律法规要求； \n' +
        '6.2.3 按照相关政府主管部门的要求；\n' +
        '6.2.4 为维护社会公众的利益；\n' +
        '6.2.5 为维护乐业的合法权益；\n' +
        '6.3 乐业可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与乐业同等的保护用户隐私的责任，则乐业有权将用户的注册资料等提供给该第三方；\n' +
        '6.4 在不透露单个用户隐私资料的前提下，乐业有权对整个用户数据库进行分析并对用户数据库进行商业上的利用；\n' +
        '6.5 乐业制定了以下四项隐私权保护原则，指导我们如何来处理产品中涉及到用户隐私权和用户信息等方面的问题：\n' +
        '6.5.1 利用我们收集的信息为用户提供有价值的产品和服务；\n' +
        '6.5.2 开发符合隐私权标准和隐私权惯例的产品；\n' +
        '6.5.3 将个人信息的收集透明化，并由权威第三方监督；\n' +
        '6.5.4 尽最大的努力保护我们掌握的信息；\n' +
        '6.6 乐业重视对未成年人个人隐私信息的保护。乐业将依赖用户提供的个人信息判断用户是否为未成年人。任何18岁以下的未成年人注册账号或使用本产品应事先取得家长或其法定监护人（以下简称“监护人”）的书面同意。除根据法律法规规定及有权机关的指示披露外，乐业不会使用或向任何第三方透露未成年人的个人隐私信息。原则上，任何18岁以下用户不得使用招聘及找工作的相关服务。\n' +
        '\n' +
        '\n' +
        '7 免责声明\n' +
        '7.1 用户理解并确认，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使服务发生中断。“不可抗力”是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观时间，包括但不限于自然灾害如洪水、地震、瘟疫流行和风暴等遗迹社会事件如战争、动乱、政府行为等。出现上述情况时，乐业将努力在第一时间与相关单位配合，及时进行修复，但是由此给用户或第三方造成的损失，乐业及合作单位在法律允许的范围内免责；\n' +
        '7.2 本产品同大多数互联网产品一样，受包括但不限于用户原因、网络服务质量、社会环境因素的差异影响，可能受到各种安全问题的侵扰，如他人利用用户资料，造成现实生活中的骚扰；用户下载安装的其他软件或访问的其他网站中含有病毒，威胁到用户的信息和数据安全，继而影响到本产品的正常使用等等。用户应加强信息安全及使用者资料的保护意识，要注意加强密码保护，以免遭致损失和骚扰；\n' +
        '7.3 用户理解并确认，在使用本产品过程中存在来自任何他人的包括误导性的、欺骗性的、威胁性的、诽谤性的、令人反感的或非法的信息，或侵犯他人权利的匿名或冒名的信息，以及伴随该等信息的行为，因此导致的用户或第三方的任何损失，乐业不承担任何责任；\n' +
        '7.4 用户理解并确认，在使用本产品服务的过程中，涉及到非本产品所提供的实际服务及雇佣关系中出现的欺骗、威胁、诽谤等行为，乐业不承担任何责任；\n' +
        '7.5 用户理解并确认，对于乐业向用户提供的下列服务的质量缺陷及引发的任何损失，乐业无需承担任何责任：\n' +
        '7.5.1 乐业向用户免费提供的服务；\n' +
        '7.5.2 乐业向用户赠送的任何产品或者服务；\n' +
        '7.6 在任何情况下，乐业均不对任何间接性、后果性、惩罚性、偶然性、特殊性或刑罚性的损害，包括因用户使用乐业及其服务而遭受的利润损失，承担责任（即使乐业已被告知该等损失的可能性亦然）；\n' +
        '7.7 乐业不担保网络服务一定能满足用户的要求，也不担保网络服务不会中断，对网络服务的及时性、安全性、准确性也都不作担保；\n' +
        '7.8 对于因电信系统或互联网网络故障、计算机故障或病毒、信息损坏或丢失、计算机系统问题或其它任何不可抗力原因而产生损失，乐业不承担任何责任，但将尽力减少因此而给用户造成的损失和影响。\n' +
        '\n' +
        '\n' +
        '8. 法律及争议解决\n' +
        '8.1 本协议适用中华人民共和国法律；\n' +
        '8.2 因本协议引起的或与本协议有关的任何争议，各方应友好协商解决；协商不成的，任何一方均可将有关争议提交至成都市仲裁委员会并按照其届时有效的仲裁规则仲裁；仲裁裁决是终局的，对各方均有约束力。\n' +
        '\n' +
        '\n' +
        '9. 其他条款\n' +
        '9.1 如果本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，或违反任何适用的法律，则该条款被视为删除，但本协议的其余条款仍应有效并且有约束力；\n' +
        '9.2 乐业有权随时根据有关法律、法规的变化以及公司经营状况和经营策略的调整等修改本协议，而无需另行单独通知用户。用户可随时通过APP注册页面浏览最新服务协议条款。当发生有关争议时，以最新的协议文本为准。如果不同意乐业对本协议相关条款所做的修改，用户有权停止使用服务。如果用户继续使用服务，则视为用户接受乐业对本协议相关条款所做的修改；\n' +
        '9.3 乐业在法律允许最大范围对本协议拥有解释权与修改权。' +
        '\n' +
        '\n'
    ;

}